configuration/src/InformationRegisters/ИсторияИзмененийОписанийОбъектов/ИсторияИзмененийОписанийОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияИзмененийОписанийОбъектов</name>
  <resources>
    <name>ОписаниеИзменений</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектИсторииИзменений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОписания</name>
    <type>
      <types>EnumRef.ВидыОписания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ИсторияИзмененийОписанийОбъектов/Forms/ПросмотрИсторииИзменений/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаИзменения = Параметры.ДатаИзменения; 
	Заголовок = СтрШаблон("Различия в описании (%1)", Формат(ДатаИзменения, "ДФ='dd.MM.yyyy HH:mm'"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсторияИзмененийОписанийОбъектов.ОписаниеИзменений КАК ОписаниеИзменений
	|ИЗ
	|	РегистрСведений.ИсторияИзмененийОписанийОбъектов КАК ИсторияИзмененийОписанийОбъектов
	|ГДЕ
	|	ИсторияИзмененийОписанийОбъектов.Объект = &Объект
	|	И ИсторияИзмененийОписанийОбъектов.Дата = &Дата";
	
	Запрос.УстановитьПараметр("Объект", Параметры.ИзмененныйОбъект);
	Запрос.УстановитьПараметр("Дата", Параметры.ДатаИзменения);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ОписаниеИзменений = Выборка.ОписаниеИзменений.Получить();
		ОписаниеИзменений = СтрЗаменить(ОписаниеИзменений, "<АдресПубликацииСтиля>", 
			ОбщегоНазначенияКлиентСервер.ДобавитьСлэш(WebОкружениеВызовСервера.АдресПубликацииСлужебныхДанных()) + "changelog.css""  charset=""utf-8");
		
		HTMLИсторияИзменений = ОписаниеИзменений;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
